# Pandas
- Introduction to Pandas

# Key Data Structure 
- Series
- DataFrame

In [1]:
import pandas as pd

# Series
- 1 Dimensional

In [4]:

s = pd.Series([1,2,3,4,5] , index=['a','b','c','d','e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

# DataFrame
- 2 Dimensional

In [5]:
df = pd.DataFrame({"names":['Ayaz','Ali','Khan'],"marks" : [100,53,68]})
df

  names  marks
0  Ayaz    100
1   Ali     53
2  Khan     68

# Read CSV File

In [7]:
data = pd.read_csv('quickr_car.csv')

# see only top data

data.head()

# see only below data

data.tail()

# see description

data.describe()

# see range index , data column , see alot of info for data cleaning 

data.info()

data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel
...,...,...,...,...,...,...
887,Ta,Tara,zest,"3,10,000",NaN,NaN
888,Tata Zest XM Diesel,Tata,2018,"2,60,000","27,000 kms",Diesel
889,Mahindra Quanto C8,Mahindra,2013,"3,90,000","40,000 kms",Diesel
890,Honda Amaze 1.2 E i VTEC,Honda,2014,"1,80,000",Petrol,NaN
891,Chevrolet Sail 1.2 LT ABS,Chevrolet,2014,"1,60,000",Petrol,NaN

# Data Selection

In [10]:
# see only id

data['name']

# see name , company
data[['name','company']]

                                       name    company
0      Hyundai Santro Xing XO eRLX Euro III    Hyundai
1                   Mahindra Jeep CL550 MDI   Mahindra
2                Maruti Suzuki Alto 800 Vxi     Maruti
3    Hyundai Grand i10 Magna 1.2 Kappa VTVT    Hyundai
4          Ford EcoSport Titanium 1.5L TDCi       Ford
..                                      ...        ...
887                                      Ta       Tara
888                     Tata Zest XM Diesel       Tata
889                      Mahindra Quanto C8   Mahindra
890                Honda Amaze 1.2 E i VTEC      Honda
891               Chevrolet Sail 1.2 LT ABS  Chevrolet

[892 rows x 2 columns]

# First Row

In [11]:
data.iloc[0]

name          Hyundai Santro Xing XO eRLX Euro III
company                                    Hyundai
year                                          2007
Price                                       80,000
kms_driven                              45,000 kms
fuel_type                                   Petrol
Name: 0, dtype: object